Consider following code to answer further questions:

In [1]:
import pandas as pd
course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer'] 
duration = [2,3,6,4]
df = pd.DataFrame(data = {'course_name': course_name, 'duration': duration})
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

# Q1. Write a code to print the data present in the second row of the dataframe, df.

In [2]:
df.loc[1]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

# Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?

loc() and iloc() both are used in slicing data from the Pandas DataFrame. They help in the convenient selection of data from the DataFrame in Python. They are used in filtering the data according to some conditions.

Note : a label refers to a specific name or identifier that is associated with a row or column in a DataFrame or Series.

loc is used to select rows and columns in dataframe based on their labels,

In [3]:
df.loc[1:3,'duration']                         # access row by using column name and row indexing

1    3
2    6
3    4
Name: duration, dtype: int64

iloc is used to select rows and columns based on their integer position.

In [4]:
df.iloc[1:3,0]                              # accessing first column by using row integer and column in integer also

1    Machine Learning
2            Big Data
Name: course_name, dtype: object

# Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df then find the output for both new_df.loc[2] and new_df.iloc[2]. Did you observe any difference in both the outputs? If so then explain it. Consider the below code to answer further questions:

In [5]:
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6'] 
indices = [1,2,3,4,5,6]
# Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.870866  0.563167  0.856440  0.249669  0.669223  0.779587
2  0.416753  0.743955  0.718277  0.479558  0.919343  0.983921
3  0.933786  0.294643  0.525379  0.684176  0.451581  0.015554
4  0.799113  0.014875  0.277159  0.343087  0.669210  0.357550
5  0.138123  0.322864  0.516023  0.320901  0.587965  0.813265
6  0.307689  0.756027  0.299302  0.488060  0.043801  0.436033

In [6]:
new_df = df1.reindex([3,0,1,2])

In [7]:
new_df.loc[2]

column_1    0.416753
column_2    0.743955
column_3    0.718277
column_4    0.479558
column_5    0.919343
column_6    0.983921
Name: 2, dtype: float64

In [8]:
new_df.iloc[2]

column_1    0.870866
column_2    0.563167
column_3    0.856440
column_4    0.249669
column_5    0.669223
column_6    0.779587
Name: 1, dtype: float64

# Q4. Write a code to find the following statistical measurements for the above dataframe dfl: (i) mean of each and every column present in the dataframe.

In [9]:
df1.mean()

column_1    0.577722
column_2    0.449255
column_3    0.532097
column_4    0.427575
column_5    0.556854
column_6    0.564318
dtype: float64

(ii) standard deviation of column, 'column_2'

In [11]:
df1['column_2'].std

<bound method NDFrame._add_numeric_operations.<locals>.std of 1    0.563167
2    0.743955
3    0.294643
4    0.014875
5    0.322864
6    0.756027
Name: column_2, dtype: float64>

# Q5. Replace the data present in the second row of column, 'column_2' by a string variable then find the mean of column, column_2. If you are getting errors in executing it then explain why. [Hint: To replace the data use dfl.loc[] and equate this to string data of your choice.]

In [12]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.870866  0.563167  0.856440  0.249669  0.669223  0.779587
2  0.416753  0.743955  0.718277  0.479558  0.919343  0.983921
3  0.933786  0.294643  0.525379  0.684176  0.451581  0.015554
4  0.799113  0.014875  0.277159  0.343087  0.669210  0.357550
5  0.138123  0.322864  0.516023  0.320901  0.587965  0.813265
6  0.307689  0.756027  0.299302  0.488060  0.043801  0.436033

In [13]:
df1.loc[2,'column_2'] = 'Nazer'

In [14]:
try:
    df1['column_2'].mean()
except TypeError as e:
    print(f'This is : ',e)

This is :  unsupported operand type(s) for +: 'float' and 'str'

We got TypeError due to use string on place of float or int

# Q6. What do you understand about the windows function in pandas and list the types of windows functions?

windows function work inside a rolling() function as a parameter, rolling means roll it self. If you provide windows = 1 no any changing will be happend

In [15]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.870866  0.563167  0.856440  0.249669  0.669223  0.779587
2  0.416753     Nazer  0.718277  0.479558  0.919343  0.983921
3  0.933786  0.294643  0.525379  0.684176  0.451581  0.015554
4  0.799113  0.014875  0.277159  0.343087  0.669210  0.357550
5  0.138123  0.322864  0.516023  0.320901  0.587965  0.813265
6  0.307689  0.756027  0.299302  0.488060  0.043801  0.436033

In [16]:
df1.rolling(window=3).mean()

/tmp/ipykernel_2219/2661563458.py:1: FutureWarning: Dropping of nuisance columns in rolling operations is deprecated; in a future version this will raise TypeError. Select only valid columns before calling the operation. Dropped columns were Index(['column_2'], dtype='object')
  df1.rolling(window=3).mean()

   column_1  column_3  column_4  column_5  column_6
1       NaN       NaN       NaN       NaN       NaN
2       NaN       NaN       NaN       NaN       NaN
3  0.740468  0.700032  0.471134  0.680049  0.593021
4  0.716551  0.506938  0.502274  0.680045  0.452342
5  0.623674  0.439520  0.449388  0.569585  0.395456
6  0.414975  0.364161  0.384016  0.433659  0.535616

# Q7. Write a code to print only the current month and year at the time of answering this question. [Hint: Use pandas.datetime function]

In [17]:
pd.to_datetime('today')

Timestamp('2023-07-01 08:53:33.979380')

# Q8. Write a Python program that takes in two dates as input (in the format YYYY-MM-DD) and calculates the difference between them in days, hours, and minutes using Pandas time delta. The program should prompt the user to enter the dates and display the result.

In [18]:
first_date = input("Enter a date in format of YYYY-MM-DD : ")
second_date = input("Enter a date in format of YYYY-MM-DD : ")

date_1 = pd.DataFrame({'F Date':[pd.to_datetime(first_date)],
                      'S Date':[pd.to_datetime(second_date)],
                      'Different':[pd.to_datetime(first_date)-pd.to_datetime(second_date)]})
date_1

Enter a date in format of YYYY-MM-DD :  2003-06-10
Enter a date in format of YYYY-MM-DD :  2023-07-01

      F Date     S Date  Different
0 2003-06-10 2023-07-01 -7326 days

# Q9. Write a Python program that reads a CSV file containing categorical data and converts a specified column to a categorical data type. The program should prompt the user to enter the file path, column name, and category order, and then display the sorted data.

In [19]:
import csv
import pandas as pd
import numpy as np

In [ ]:
# file_path = "E:\\dummy_data\\taxonomy.csv"
file_path = input("Enter file location with file name : ")

column_name = input("Enter file categorical column name : ")
# column_name = "parent_name"

category_order = bool(input("Enter column order True or False : "))
# category_order = True

df = pd.read_csv(file_path, encoding='utf-8')
print(f"Your file datas are : \n {df}")

In [ ]:
pd.Categorical(df[column_name],ordered=category_order)

# Q10. Write a Python program that reads a CSV file containing sales data for different products and visualizes the data using a stacked bar chart to show the sales of each product category over time. The program should prompt the user to enter the file path and display the chart.

In [ ]:
file_path = input("Enter file location with file name : ")
df = pd.read_csv(file_path)
# display(df.head())
display(df.plot.scatter(x= 'TYPE OF HOME',y='TOTAL NO. OF PROPERTIES'))

# Q11. You are given a CSV file containing student data that includes the student ID and their test score. Write a Python program that reads the CSV file, calculates the mean, median, and mode of the test scores, and displays the results in a table.

The program should do the following:

Prompt the user to enter the file path of the CSV file containing the student data. Read the CSV file into a Pandas DataFrame. Calculate the mean, median, and mode of the test scores using Pandas tools. Display the mean, median, and mode in a table. Assume the CSV file contains the following columns:

Student ID: The ID of the student. Test Score: The score of the student's test. Example usage of the program: Enter the file path of the CSV file containing the student data: student_data.csv

+-----------+-------+ | Statistic | Value | +-----------+-------+ | Mean |179.6 | | Median | 82 | | Mode | 85,90 | +-----------+-------+

Assume that the CSV file student_data.csv contains the following data: Student ID,Test Score 1,85 2,90 3,80 4,75 5,85 6,82 7,78 8,85 9,90 10,85 The program should calculate the mean, median, and mode of the test scores and display the results in a table.

In [ ]:
path = "E:\\dummy_data\\student data.csv"
df = pd.read_csv(path)

print('Get mean pd.DataFrame')
# display(df.mean())
display(df.mean)

print('Get mddian pd.DataFrame')
# display(df.median())
display(df.median)

print('Get mode pd.DataFrame')
# display(df.mode)
display(df.mode())